============================================
Primitive-typed variable declarations
============================================

{
    Integer b, c = 5, d;
    Text d, e;
    Real f, g = 2.0, h = 2.12345;
}

---

(source_file
    (compound_statement
        (declaration
            type: (primitive_type)
            declarator: (identifier)
            declarator: (init_declarator
            declarator: (identifier)
            value: (number_literal))
            declarator: (identifier))
        (declaration
            type: (primitive_type)
            declarator: (identifier)
            declarator: (identifier))
        (declaration
            type: (primitive_type)
            declarator: (identifier)
            declarator: (init_declarator
                declarator: (identifier)
                value: (number_literal))
            declarator: (init_declarator
                declarator: (identifier)
                value: (number_literal)))))

============================================
Function definitions
============================================

void do_stuff(Integer arg1) {
    return 5;
}

---

(source_file
    (function_definition
        (primitive_type)
        (function_declarator 
            (identifier) 
            (parameter_list
                (parameter_declaration
                    (primitive_type)
                    (identifier))))
        (compound_statement
            (return_statement (number_literal)))))

===================================================
Function definition with reference type parameters
===================================================

void do_stuff(Integer &arg1) {
    return 5;
}

---

(source_file
    (function_definition
        (primitive_type)
        (function_declarator 
            (identifier)
            (parameter_list
                (parameter_declaration
                    (primitive_type)
                    (pointer_declarator
                        (identifier)))))
        (compound_statement
            (return_statement
              (number_literal)))))


===================================================
Function definition with array reference type parameter
===================================================

void do_stuff(Integer &arg1[]) {
    return;
}

---

(source_file
    (function_definition
        (primitive_type)
        (function_declarator 
            (identifier)
            (parameter_list
                (parameter_declaration
                    (primitive_type)
                    (pointer_declarator
                        (array_declarator
                            (identifier))))))
        (compound_statement
            (return_statement))))

================================
Local array declarations
================================

Integer main() {
    Integer the_buffer[the_size];
}

---

(source_file
    (function_definition
        (primitive_type)
        (function_declarator 
            (identifier) (parameter_list))
        (compound_statement
            (declaration 
                (primitive_type)
                (array_declarator 
                    (identifier) (identifier))))))
